of60/tutorials/rheoBDFoam/flowFocusing/pressureDrivenFlow/flowSimulation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rheoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          2e-5;

writeControl    adjustableRunTime;

writeInterval   .005;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep off;

maxCo          1.5;

maxDeltaT      0.01;

functions
{

 // Monitor for convergence

    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        writeControl   timeStep;
        writeInterval  10;

        // Fields to be probed
        fields
        (
            U
        );

        probeLocations
        (
             (-100e-6 0 0)
             (100e-6 0 0)
             (300e-6 0 0)
        );
    }

}

// ************************************************************************* //
